import sqlite3

DB_PATH = 'database.db'

def init_db():
    conn = sqlite3.connect(DB_PATH)
    cursor = conn.cursor()
    
    cursor.execute('''
        CREATE TABLE IF NOT EXISTS members (
            id INTEGER PRIMARY KEY AUTOINCREMENT,
            full_name TEXT NOT NULL,
            nickname TEXT NOT NULL,
            class_room TEXT NOT NULL,
            role TEXT NOT NULL
        )
    ''')
    
    cursor.execute('''
        CREATE TABLE IF NOT EXISTS attendance (
            id INTEGER PRIMARY KEY AUTOINCREMENT,
            member_id INTEGER,
            date TEXT NOT NULL,
            status TEXT NOT NULL,
            note TEXT,
            lat REAL,
            lng REAL,
            time_recorded TEXT,
            UNIQUE(member_id, date),
            FOREIGN KEY (member_id) REFERENCES members (id)
        )
    ''')
    
    cursor.execute("SELECT COUNT(*) FROM members")
    if cursor.fetchone()[0] == 0:
        initial_members = [
            # ม.5
            ("นางสาวพิมรภัทร แบนคล้าย", "ไอซ์", "ม.5/1", "สารวัตรนักเรียน"),
            ("นายธีรเดช ไพศาลพิสุทธิ์", "เนส", "ม.5/1", "สารวัตรนักเรียน"),
            ("นางสาวธมนวรรณ แบนคล้าย", "โรส", "ม.5/2", "สารวัตรนักเรียน"),
            ("นางสาวชยุตรา ชมป้อม", "น้ำเพรช", "ม.5/2", "สารวัตรนักเรียน"),
            ("นายฐิติวุติ สีสวย", "โชค", "ม.5/2", "สารวัตรนักเรียน"),
            ("นายณฐกร เส็งสิน", "เบลเยียม", "ม.5/2", "สารวัตรนักเรียน"),
            ("นางสาวฐิติรัตน์ พนัสขาว", "อาย", "ม.5/3", "สารวัตรนักเรียน"),
            ("นางสาวชญานิษฐ์ พรหมเกิด", "เอย", "ม.5/3", "สารวัตรนักเรียน"),
            ("นางสาวบุญญารัตน์ สุขนวน", "กรานต์", "ม.5/3", "สารวัตรนักเรียน"),
            ("นายภูริณัฐ แก้วศรีเมือง", "กร", "ม.5/3", "สารวัตรนักเรียน"),
            ("นายกฤษดา โทนกล้า", "การ์ตูน", "ม.5/5", "สารวัตรนักเรียน"),
            ("นายธนวรรธน์ โพธิ์เกิด", "บัส", "ม.5/5", "สารวัตรนักเรียน"),
           
            
            # ม.6
            ("นายกนิชนนท์ มิตรเอม", "เนวา", "ม.6/1", "สารวัตรนักเรียน"),
            ("นายธีรภัทร ศิริธัญญาภรณ์", "โก", "ม.6/1", "เลขาสารวัตรนักเรียน"),
            ("นางสาวณัทนิพพิชน์ ลัดดากลม", "ขิง", "ม.6/1", "รองหัวหน้าสารวัตรนักเรียน"),
            ("นายณัฏฐกิตติ์ คล้ายทรัพย์", "ปั๊ม", "ม.6/3", "รองหัวหน้า สารวัตรนักเรียน"),
            ("นายกตัญญู เทียนคำ", "หิน", "ม.6/3", "สารวัตรนักเรียน"),
            ("นายวีรพล พริกทิม", "มังกร", "ม.6/3", "สารวัตรนักเรียน"),
            ("นายปวริพัฒฑ์ ภาคภูมิ", "มิ้น", "ม.6/4", "สารวัตรนักเรียน"),
            ("นายทยากร เปรี่ยมพิมาย", "คุณ", "ม.6/4", "สารวัตรนักเรียน"),
            ("นายณฐวัฒน์ ขุนโต", "ที", "ม.6/4", "สารวัตรนักเรียน"),
            ("นายณัฐพงษ์ ชุ่มสอน", "อเล็กซ์", "ม.6/5", "หัวหน้าสารวัตรนักเรียน"),
            ("นางสาวคุณาภรณ์ โกนดี", "ปอนด์", "ม.6/5", "สารวัตรนักเรียน"),
             ("นายณัฐดนัย กาทอง", "เซฟ", "ม.6/5", "สารวัตรนักเรียน"),
            
            # เสมารักษ์
            ("นายบารมี เล็กศิริมนตรี", "ต้นกล้า", "ม.4/3", "เสมารักษ์"),
            ("นางสาวนิชาภัทร แผลงไพรี", "พลอย", "ม.4/3", "เสมารักษ์"),
            ("นางสาวพิชญดา ไชโย", "ฟ่าง", "ม.4/4", "เสมารักษ์"),
            ("นางสาวมนชญา สาระพา", "อ๊ะอาย", "ม.4/4", "เสมารักษ์"),
            ("นางสาวธัญชนก เอี่ยมราชวงค์", "ตอง", "ม.4/4", "เสมารักษ์"),
            ("นายกิตตินันท์ เกิดธารา", "บอส", "ม.4/4", "เสมารักษ์"),
            ("นางสาวบุญลักษณ์ ใจสุกใส", "เกรท", "ม.4/4", "เสมารักษ์"),
            ("นางสาวธิติรัตน์ดา พ่วงบุใหญ่", "ป้าง", "ม.4/4", "เสมารักษ์"),
            ("นายศุภเดช คำผานาง", "ออโต้", "ม.4/4", "เสมาลักษณ์"),
            ("นายปัณณวิชญ์ ใจกล้า", "เจเจ", "ม.4/5", "เสมารักษ์"),
            ("นางสาวณัฐนรี น้อยรุ่ง", "ปุยฝ้าย", "ม.4/5", "เสมารักษ์"),
            ("นางสาวสุธาสินี องอาจ", "ข้าว", "ม.4/5", "เสมารักษ์"),
            ("นายธนทวัฒน์ สายัญ", "แม็ก", "ม.4/5", "เสมารักษ์"),
            ("นายเชษฐ์ดนัย วังคีรี", "ไผ่", "ม.5/5", "เสมารักษ์"),
            ("นายพชรพล ทิมเกลี้ยง", "พีท", "ม.5/5", "เสมารักษ์"),
            ("นายธนกร รุ่งเรือง", "กัส", "ม.5/5", "เสมารักษ์"),
           

        ]
        cursor.executemany("INSERT INTO members (full_name, nickname, class_room, role) VALUES (?, ?, ?, ?)", initial_members)
        conn.commit()
        print("Database initialized successfully.")
        
    conn.close()

if __name__ == '__main__':
    init_db()